quick_test.yml
execution:
- executor: locust
  concurrency: 100 # number of target concurrent virtual users
  hold-for: 1m  # test duration
  scenario: test # test to run (see 'scenarios')

scenarios:
  test:
    default-address: https://www.storypal.co  # test endpoint
    script: app.py # python script that contains your locust load test

reporting:
  - module: final-stats
    summary: true  # overall samples count and percent of failures
    percentiles: true  # display average times and percentiles
    failed-labels: false  # provides list of sample labels with failures
    test-duration: true  # provides test duration
    dump-csv: stats.csv